# Document Set Default Family Type Id Method

Source: https://www.revitapidocs.com/2026/1f0d5aac-4602-b479-82b4-dc54a030c0a3.htm

---

| Document Set Default Family Type Id Method |
| --- |

Sets the default family type id for the given family category.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetDefaultFamilyTypeId(
	ElementId familyCategoryId,
	ElementId familyTypeId
)
```

```
Public Sub SetDefaultFamilyTypeId (
	familyCategoryId As ElementId,
	familyTypeId As ElementId
)
```

```
public:
void SetDefaultFamilyTypeId(
	ElementId^ familyCategoryId,
	ElementId^ familyTypeId
)
```

```
member SetDefaultFamilyTypeId :
        familyCategoryId : ElementId *
        familyTypeId : ElementId -> unit
```

#### Parameters

familyCategoryId ElementId
:   The family category id.

familyTypeId ElementId
:   The default family type id.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The family type id familyTypeId is invalid for the give family category familyCategoryId.  \-or\-  familyCategoryId is not a built in category or parameter Element ID. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

Document Class Autodesk.Revit.DB Namespace